<!--  - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині-->
<!--  - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині-->
<!--  - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.-->
<!--  - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.-->

for (let i = 0; i < 10; i++) {
    document.write(`<div>
                            <h2>Довільний текст</h2>
                            <p>Індекс - ${i}</p>
                    </div>`);
}

let i = 0;
while (i < 20) {
    document.write(`<h1>Довільний текст - ${i}</h1>`);
    console.log(i);
    i++;
}
