<!--Логічні розгалуження:-->
<!-- - Є змінна х, якій ви надаєте довільне числове значення.-->
<!--Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3-->
<!-- - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число-->
<!--(в першу, другу, третю или четверту частину години).-->
<!-- - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).-->
<!-- - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).-->
<!-- - Користувач вводить або має два числа.-->
<!--Потрібно знайти та вивести максимальне число з тих двох .-->
<!--Також потрібно врахувати коли введені рівні числа.-->


<!-- - Є змінна х, якій ви надаєте довільне числове значення.-->
<!--Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3-->

let x = 0;
let z = [1, 0, -3];

for (let i = 0; i < z.length;  i++){
    if (x === z[i]) {
        console.log('Невірно')
    }
    else {
        console.log('Вірно')
    }

}


<!-- - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число-->
<!--(в першу, другу, третю или четверту частину години).-->

let time = 44;

for (let i = 0; i < time;  i++){
    if (time <= 14) {
        console.log('Перша четверть')
    }
    else if (time <= 29){
        console.log('Друга четверть')
    }
    else if (time <= 44) {
        console.log('Третя четверть')
    }
    else {
        console.log('Четверта четверть')
    }

}


<!-- - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).-->

let day = 27;

for (let i = 1; i < day;  i++){
    if (day <= 10) {
        console.log('Перша декада')
    }
    else if (day <= 20){
        console.log('Друга декада')
    }
    else {
        console.log('Третя декада')
    }

}


<!-- - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).-->

let week = prompt('enter day number');


switch (week) {
    case '1':
        console.log('Monday');
        break;
    case '2':
        console.log('Tuesday');
        break;
    case '3':
        console.log('Wednesday');
        break;
    case '4':
        console.log('Thursday');
        break;
    case '5':
        console.log('Friday');
        break;
    case '6':
        console.log('Saturday');
        break;
    case '7':
        console.log('Sunday');
        break;
    default:
        console.log('????');
}


<!-- - Користувач вводить або має два числа.-->
<!--Потрібно знайти та вивести максимальне число з тих двох .-->
<!--Також потрібно врахувати коли введені рівні числа.-->

let a1 = 5, b1 = 8;

if (a1 > b1) {
    console.log('a > b');
}
else if (a1 < b1) {
    console.log('a < b');
}
else console.log('a = b');

