<!--ВСЕ ЗРОБИТИ СТРІЛОЧНИМИ ФУНКЦІЯМИ!-->
<!-- - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б-->
<!-- - створити функцію яка обчислює та повертає площу кола з радіусом r-->
<!-- - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r-->
<!-- - створити функцію яка приймає масив та виводить кожен його елемент-->

<!-- - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б-->
let areaRectangle2 = (a,b) => a * b;
console.log(areaRectangle2(10,20));

<!-- - створити функцію яка обчислює та повертає площу кола з радіусом r-->
let areaRound2 = (r) => Math.PI * r * r;
console.log(areaRound2(5));

<!-- - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r-->
let areaCylinder2 = (r,h) => 2 * Math.PI * r * (h + r);
console.log(areaCylinder2(10,20));

<!-- - створити функцію яка приймає масив та виводить кожен його елемент-->
let arrayOutput = (arr) => console.log(arr);
arrayOutput([1,2,3,4,5]);