<!--"JS_les5_hw2.js"-->
<!-- - створити функцію яка створює параграф з текстом. Текст задати через аргумент-->
<!-- - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий-->
<!-- - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)-->

<!-- - створити функцію яка створює параграф з текстом. Текст задати через аргумент-->
let textParagraph = (text) => document.write(`<p>${text}</p>`);
textParagraph('myText');

<!-- - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий-->
let text3X = (text) => document.write(`<ul><li>${text}</li><li>${text}</li><li>${text}</li></ul>`);
text3X('myText_2');

<!-- - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)-->
let textAnyLi = (text,count) => document.write(`<ul> {for (let i = 0; i < count; i++){<li>${text}</li>}</ul>`);
textAnyLi('myText_3',5);